---
type: FailureDefinitionId
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# FailureDefinitionId

`Autodesk.Revit.DB.FailureDefinitionId` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FailureDefinitionId | — | `public FailureDefinitionId ( Guid guid )` |